import Header from "@/components/HeaderSection/Header";
import Mainfooter from "../../components/MainFooter/mainFooter";
import React from "react";
import axios from "axios";
import parse from "html-react-parser";
const index = ({ settingsData }) => {
  return (
    <>
      <div>
        {/* termsAndConditions */}
        <Header />
        <div className="container">
          <h1 className="mt-5 mb-5 text-center">الأحكام والشروط</h1>

          <div className="terms-box mb-5 m-auto">
            {parse(settingsData?.termsAndConditions)}
            {/* <ul>
              <li className="mb-2">
                معلومات موقع جيت8 ( Gate8 ) الإلكتروني والمسجلين فيها هم منظم
                الرحلة والمشارك في الرحلة
              </li>
              <li className="mb-2">
                موقع جيت8 هو منصة لربط المنظمين للرحلات بالمشاركين المهتمين
                بالانضمام إلى الرحلات.
              </li>
              <li className="mb-2">
                موقع جيت8 يقدم منصة للمنظم لنشر معلومات حول الرحلة بما في ذلك
                التواريخ والأنشطة والتكاليف التي يقدمها منظم الرحلة
              </li>
              <li className="mb-2">
                موقع جيت8 ليس مسؤولًا عن صحة المعلومات المقدمة من قبل المنظم أو
                أي ترويج للرحلة.
              </li>

              <li className="mb-2">
                المشاركين يستطيعون التسجيل على موقع جيت8 والمشاركة في الرحلة
                بناءً على اختيارهم.
              </li>
              <li className="mb-2">
                موقع جيت8 لا يتدخل في ترتيبات تنظيم الرحلة أو دفع الأموال بين
                المنظم والمشاركين.
              </li>
              <li className="mb-2">
                موقع جيت8 غير مسؤول عن أية مشكلات أو توترات تنشأ بين المنظم
                والمشاركين.
              </li>
              <li className="mb-2">
                موقع جيت8 لا يتحمل مسؤولية أي أضرار أو خسائر مادية أو معنوية
                تنجم عن استخدام موقع جيت8.
              </li>

              <li className="mb-2">
                المشاركين يوافقون على أن موقع جيت8 يعمل كوسيط رقمي فقط وليس له
                أي دور في تنظيم الرحلة نفسها.
              </li>

              <li className="mb-2">
                المشاركين يوافقون على إخلاء موقع جيت8 من أي مسؤولية تجاه الأضرار
                أو الخسائر التي يمكن أن تحدث خلال الرحلة.
              </li>
              <li className="mb-2">
                قد نساعدك في موقع جيت8 على التواصل مع منظم الرحلة الخاص بك، لكن
                لا يمكننا ضمان أنه سيقرأ أي شيء منك، أو أنه سيفعل ما تطلبه.
                حقيقة أنك تتواصل معه، أو أنه يتصل بك، في حد ذاتها، لا تعني أنه
                لديك أي سبب لاتخاذ إجراء قانوني
              </li>

              <li className="mb-2">
                المشارك يوافق على هذه البنود والشروط عند التسجيل على موقع جيت 8
                والمشاركة في الرحلة.
              </li>
            </ul>

            <ul>
              <li className="mb-2">
                لملكية الفكرية وحقوق النشر والتوزيع والخصوصية{" "}
              </li>
              <li className="mb-2">
                المنظم للرحلة يحتفظ بحقوق الملكية الفكرية للمحتوى والمواد
                المنشورة بواسطته على موقع جيت8 بما في ذلك النصوص والصور والمقاطع
                كما يلتزم بقوانين حقوق الملكية والنشر والتوزيع في جميع منشوراته
                بدون ادنى مسؤولية على موقع جيت8
              </li>
              <li className="mb-2">
                المشاركين لا يحق لهم نسخ أو تعديل أو نشر أو توزيع المحتوى
                الموجود على موقع جيت8 دون إذن خطي من المنظم.
              </li>
              <li className="mb-2">
                المشاركين يوافقون على أن المعلومات والبيانات التي يتم تقديمها
                على موقع جيت 8 يمكن استخدامها من قبل المنظم وموقع جيت8 لأغراض
                تنظيم الرحلة والتواصل مع المشاركين
              </li>
              <li className="mb-2">
                موقع جيت8 يمكن استخدام معلومات المشاركين للأغراض التسويقية
                والدعائية بما في ذلك إعلانات المنظمين على موقع جيت8.​
              </li>
              <li className="mb-2">
                المشاركين يوافقون على أن موقع جيت8 يحق له استخدام معلوماتهم في
                الدعاية والإعلان لرحلات أخرى على موقع جيت8.
              </li>
              <li className="mb-2">
                {" "}
                وتسويقيه فقط 2.7 يقوم المشارك بتحميل بعض الملفات الخاصة به على
                موقع جيت8 على سبيل المثال لا الحصر صور جوازات السفر صور ايصالات
                الدفع وغيرها من المستندات حيث انها تصل مباشرة لمنظم الرحلة ولا
                يملك موقع جيت8 إمكانية الاطلاع عليها ويلتزم منظم الرحلة
                بالمحافظة على خصوصية هذه المستندات وسريتها ولا يحق له إعادة
                نشرها او استخدامها لغير الغرض المخصص له ​ موقع جيت8 يلتزم بحماية
                خصوصية المشاركين وعدم مشاركة معلوماتهم الشخصية مع أطراف خارجية
                بدون إذن ويستثنى من ذلك معلومات التواصل وذلك لأغراض دعائية
              </li>
              <li className="mb-2">
                المشارك يوافق على هذه البنود والشروط عند التسجيل على الموقع
                والمشاركة في الرحلة.​
              </li>
            </ul>
            <ul>
              <li className="mb-2">
                واجبات المشاركين في الرحلات مع منظم الرحلة عبر موقع جيت8 ​
              </li>
              <li className="mb-2">
                المشاركين ملزمون باتباع التعليمات والتوجيهات الصادرة من المنظم
                للرحلة.
              </li>
              <li className="mb-2">
                يجب على المشاركين الامتثال للجدول الزمني والأنشطة المقترحة
                والقوانين المحلية أثناء الرحلة.{" "}
              </li>
              <li className="mb-2">
                الصادرة عن المنظم.​ يجب على المشاركين الإبلاغ عن أي مشكلة أو
                أخطار تؤثر على السلامة.​ ​
              </li>
              <li className="mb-2">
                المشاركين يلتزمون بالتواصل مع المنظم للرحلة بشكل فعال وفي الوقت
                المناسب.​
              </li>
              <li className="mb-2">
                المنظم للرحلة يحتفظ بحق إلغاء مشاركة أي فرد يخالف التعليمات أو
                يعرض سلامة الرحلة للخطر.​
              </li>
              <li className="mb-2">
                في حالة إلغاء مشاركة المشارك نتيجة لعدم الامتثال، لن يتم استرداد
                أية أموال.​
              </li>
              <li className="mb-2">
                في حالة إلغاء مشاركة المشارك نتيجة لعدم الامتثال، لن يتم استرداد
                أية أموال.​
              </li>
              <li className="mb-2">
                المشارك يوافق على هذه البنود والشروط عند التسجيل على الموقع
                والمشاركة في الرحلة.
              </li>
            </ul>

            <ul>
              <li className="mb-2">4-منظم الرحلة تعريفات واجبات والتزامات</li>
              <li className="mb-2">
                المنظم للرحلة مسؤول عن إنشاء ونشر تفاصيل الرحلة على موقع جيت8
                بشكل دقيق ومفصل.​
              </li>
              <li className="mb-2">
                المنظم يلتزم بتقديم معلومات صحيحة ومحدثة بشأن تاريخ الرحلة
                والتكاليف والأنشطة.​
              </li>
              <li className="mb-2">
                المنظم للرحلة يقدم وسيلة الدفع المناسبة للمشاركين في الرحلة حيث
                ان جميع التعاملات المالية تكون فقط بين منظم الرحلة والمشارك فيها
                دون أي تدخل او مسؤوليه
              </li>
              <li className="mb-2">
                {" "}
                يجب دفع تكلفة المشاركة كما هو محدد في الاتفاقية مباشرة من
                المشارك للمنظم​
              </li>
              <li className="mb-2">
                {" "}
                يلتزم منظم الرحلة بتقديم اتفاقية كاملة للمشارك تتضمن التكلفة
                وسياسات الإلغاء ان وجدت وكذلك معلومات تامين السفر وغيرها من
                البنود التي تضمن حق جميع الأطراف حيث انه موقع جيت8 غير مسؤول عن
                الاتفاق بين المنظم والمشارك​ ​
              </li>
              <li className="mb-2">
                {" "}
                المنظم للرحلة غير مسؤول عن فقدان أو تلف الممتلكات الشخصية
                للمشاركين. كما أنه غير مسؤول عن أية إصابات تحدث خلال الرحلة، ما
                لم تنجم عن إهمال واضح من جانب المنظم ويحدد ذلك طرف ثالث.​
              </li>
            </ul> */}
          </div>
        </div>
      </div>
    </>
  );
};
export async function getServerSideProps() {
  try {
    let settingsData = await axios.get(
      `${process.env.NEXT_PUBLIC_BASE_URL}/admins/get-settings`
    );
    return {
      props: {
        settingsData: settingsData?.data?.data,
      },
    };
  } catch (err) {
    return { props: {} };
  }
}
export default index;
